{
  "m3b-bms": {
    "title": "Brewery Management System",
    "description": "This is a portfolio application designed to help craft beverage or breweries run their business - from recipe creation, to inventory and client base management including a delivery feature. \n This app is intended to be a personal project showcasing web development skills as part of a portfolio. It's a CRUD app built using NextJS, a meta framework based on ReactJS, and coded in TypeScript. The app is connected to a MongoDB database and has the potential to be a dedicated end-to-end solution for the brewery industry.",
    "features": [
      "Authentication and Authorization with Users management",
      "Create and manage products and inventory (beers only for now) - create, edit, read, and delete",
      "Step form for creating products and recipes",
      "Manage Domain's client base and deliveries",
      "Styled with Ant Design and Bootstrap",
      "App is integrated with a NoSQL MongoDB Database.",
      "Google Places, Maps, and Autofill API integration"
    ],
    "prodLink": "https://m3b-mgtm-service.vercel.app/",
    "githubLink": "https://github.com/m3c-ode/m3b-mgtm-service",
    "images": [
      {
        "original": "img/portfolio/m3b-bms-1.png",
        "description": "Product table example"
      },
      {
        "original": "img/portfolio/m3b-bms-2.png",
        "description": "New product creation - step form"
      },
      {
        "original": "img/portfolio/m3b-bms-3.png",
        "description": "Delivery service with Google API implementation - Places, Directions"
      },
      {
        "original": "img/portfolio/m3b-bms-4.png",
        "description": "Client base management with delivery option"
      }
    ]
  },
  "elm": {
    "title": "Employee Leave Manager",
    "description": "An ASP.NET Core and Entity Framework based web application for managing employee leaves. This is another portfolio app to learn, use and leverage the Microsoft .NET environment.",
    "features": [
      "Authentication integrated with ASP.NET Core Identity",
      "Admin have a dashboard view. They can manage Employees, Leave Types, and Allocate leaves to Employees.",
      "Employees can request Leaves to Admins",
      "MVC Pattern and C# syntax",
      "Designed with Bootstrap",
      "External Services: Integration with email services for seamless communication and notifications",
      "Deployment: The application has been deployed to Microsoft Azure cloud platform, through a CI/CD pipeline using GitHub",
      "IIS (Internet Information Services): The application has been published and hosted on a local IIS server for testing purposes",
      "SQL Server: The application is integrated with a SQL Server database to store and manage data related to employees, leave types, and leave requests"
    ],
    "prodLink": "https://leavemanagementweb20231123090405.azurewebsites.net",
    "githubLink": "https://github.com/m3c-ode/LeaveManagementApp",
    "images": [
      {
        "original": "img/portfolio/elm-1.png",
        "description": "Login page"
      },
      {
        "original": "img/portfolio/elm-2.png",
        "description": "Admin view dashboard"
      },
      {
        "original": "img/portfolio/elm-3.png",
        "description": "Employee Management View"
      },
      {
        "original": "img/portfolio/elm-4.png",
        "description": "Leave Types Management View"
      },
      {
        "original": "img/portfolio/elm-5.png",
        "description": "Employee View of their Requests and Allocations"
      }
    ]
  },
  "quizme": {
    "title": "QuizMe",
    "description": "QuizMe is an interactive quiz platform that allows users to create, share, and participate in quizzes on a wide range of topics. Whether you're a student looking to test your knowledge, an educator creating quizzes for your class, or just someone who loves trivia, QuizMe provides a user-friendly and engaging experience for all. In addition, QuizMe integrates OpenAI's API in order to provide some assistance with Questions and Answers generation, when provided with a Theme.",
    "features": [
      "Create Quizzes: Easily create quizzes with multiple-choice questions and answers. Add questions to your quizzes and set correct answers.",
      "AI integration: Have a theme but would like to find inspiration for a Question and Answers? With 'Ai Generation', you can generate content that will also choose the answer which is right. Be aware though, that it may not always be accurate. Double check before validating!",
      "Share and Discover: Share your quizzes with others or explore a variety of quizzes created by the QuizMe community.",
      "Challenge Friends: Challenge your friends to take your quiz and see who scores the highest.",
      "Track Progress: Keep track of your quiz attempts and scores. See how you improve over time.",
      "User-Friendly: QuizMe is designed with a clean and intuitive user interface, making it accessible to users of all ages and backgrounds.",
      "Deployment: Deployed to use in the shared link to use for all",
      "Frontend: HTML, SCSS, Javascript, jQuery, EJS",
      "Backend: NodeJS, Express.js, PostgreSQL with session based authentication"
    ],
    "prodLink": "https://quiz-me.nexxai.dev/",
    "githubLink": "https://github.com/m3c-ode/quiz-me/tree/master",
    "images": [
      {
        "original": "img/portfolio/quizme/quizme-create-with-ai.gif",
        "description": "Create with AI"
      },
      {
        "original": "img/portfolio/quizme/quizme-home.png",
        "description": "Home page"
      },
      {
        "original": "img/portfolio/quizme/quizme-quizzes.png",
        "description": "Quizzes page"
      },
      {
        "original": "img/portfolio/quizme/quizme-create-ai.png",
        "description": "Create quiz"
      },
      {
        "original": "img/portfolio/quizme/quizme-create-ai.png",
        "description": "Create quiz"
      },
      {
        "original": "img/portfolio/quizme/quizme-take-quiz.png",
        "description": "Take quiz"
      },
      {
        "original": "img/portfolio/quizme/quizme-attempts.png",
        "description": "Attempts page"
      },
      {
        "original": "img/portfolio/quizme/quizme-attempt-details.png",
        "description": "Attempt details quiz"
      }
    ]
  }
}