{
  "m3b-bms": {
    "title": "Brewery Management System",
    "description": "This is a portfolio application designed to help craft beverage or breweries run their business - from recipe creation, to inventory and client base management including a delivery feature. \n This app is intended to be a personal project showcasing web development skills as part of a portfolio. It's a CRUD app built using NextJS, a meta framework based on ReactJS, and coded in TypeScript. The app is connected to a MongoDB database and has the potential to be a dedicated end-to-end solution for the brewery industry.",
    "features": [
      "Authentication and Authorization with Users management",
      "Create and manage products and inventory (beers only for now) - create, edit, read, and delete",
      "Step form for creating products and recipes",
      "Manage Domain's client base and deliveries",
      "Styled with Ant Design and Bootstrap",
      "App is integrated with a NoSQL MongoDB Database.",
      "Google Places, Maps, and Autofill API integration"
    ],
    "prodLink": "https://m3b-mgtm-service.vercel.app/",
    "githubLink": "https://github.com/m3c-ode/m3b-mgtm-service",
    "images": [
      {
        "original": "img/portfolio/m3b-bms-1.png",
        "description": "Product table example"
      },
      {
        "original": "img/portfolio/m3b-bms-2.png",
        "description": "New product creation - step form"
      },
      {
        "original": "img/portfolio/m3b-bms-3.png",
        "description": "Delivery service with Google API implementation - Places, Directions"
      },
      {
        "original": "img/portfolio/m3b-bms-4.png",
        "description": "Client base management with delivery option"
      }
    ]
  },
  "elm": {
    "title": "Employee Leave Manager",
    "description": "An ASP.NET Core and Entity Framework based web application for managing employee leaves. This is another portfolio app to learn, use and leverage the Microsoft .NET environment.",
    "features": [
      "Authentication integrated with ASP.NET Core Identity",
      "Admin have a dashboard view. They can manage Employees, Leave Types, and Allocate leaves to Employees.",
      "Employees can request Leaves to Admins",
      "MVC Pattern and C# syntax",
      "Designed with Bootstrap",
      "External Services: Integration with email services for seamless communication and notifications",
      "Deployment: The application has been deployed to Microsoft Azure cloud platform, through a CI/CD pipeline using GitHub",
      "IIS (Internet Information Services): The application has been published and hosted on a local IIS server for testing purposes",
      "SQL Server: The application is integrated with a SQL Server database to store and manage data related to employees, leave types, and leave requests"
    ],
    "prodLink": "https://leavemanagementweb20231123090405.azurewebsites.net",
    "githubLink": "https://github.com/m3c-ode/LeaveManagementApp",
    "images": [
      {
        "original": "img/portfolio/elm-1.png",
        "description": "Login page"
      },
      {
        "original": "img/portfolio/elm-2.png",
        "description": "Admin view dashboard"
      },
      {
        "original": "img/portfolio/elm-3.png",
        "description": "Employee Management View"
      },
      {
        "original": "img/portfolio/elm-4.png",
        "description": "Leave Types Management View"
      },
      {
        "original": "img/portfolio/elm-5.png",
        "description": "Employee View of their Requests and Allocations"
      }
    ]
  },
  "quizme": {
    "title": "QuizMe",
    "description": "QuizMe is an interactive quiz platform that allows users to create, share, and participate in quizzes on a wide range of topics. Whether you're a student looking to test your knowledge, an educator creating quizzes for your class, or just someone who loves trivia, QuizMe provides a user-friendly and engaging experience for all. Have a theme but would like to find inspiration for a Question and Answers? Quizme integrates OpenAI's API to assist with content creation. Double checking the right answer is always a good idea.",
    "features": [
      "Create Quizzes: Easily create quizzes with multiple-choice questions and answers. Add questions to your quizzes and set correct answers.",
      "Share and Discover: Share your quizzes with others or explore a variety of quizzes created by the QuizMe community.",
      "AI integration: Generate content that will also choose the answer which is right.",
      "Challenge Friends: Challenge your friends to take your quiz and see who scores the highest.",
      "Track Progress: Keep track of your quiz attempts and scores. See how you improve over time.",
      "User-Friendly: QuizMe is designed with a clean and intuitive user interface, making it accessible to users of all ages and backgrounds.",
      "Deployment: Deployed to use in the shared link to use for all",
      "Frontend: HTML, SCSS, Javascript, jQuery, EJS",
      "Backend: NodeJS, Express.js, PostgreSQL with session based authentication"
    ],
    "prodLink": "https://quiz-me.nexxai.dev/",
    "githubLink": "https://github.com/m3c-ode/quiz-me/tree/master",
    "images": [
      {
        "original": "img/portfolio/quizme/quizme-create-with-ai.gif",
        "description": "Create with AI"
      },
      {
        "original": "img/portfolio/quizme/quizme-home.png",
        "description": "Home page"
      },
      {
        "original": "img/portfolio/quizme/quizme-quizzes.png",
        "description": "Quizzes page"
      },
      {
        "original": "img/portfolio/quizme/quizme-create-ai.png",
        "description": "Create quiz"
      },
      {
        "original": "img/portfolio/quizme/quizme-create-ai.png",
        "description": "Create quiz"
      },
      {
        "original": "img/portfolio/quizme/quizme-take-quiz.png",
        "description": "Take quiz"
      },
      {
        "original": "img/portfolio/quizme/quizme-attempts.png",
        "description": "Attempts page"
      },
      {
        "original": "img/portfolio/quizme/quizme-attempt-details.png",
        "description": "Attempt details quiz"
      }
    ]
  },
  "comeeat": {
    "title": "Come Eat!",
    "description": "Ever wanted to discover new places with like minded Individuals? 'Come Eat' allows you to, either you're a local foodie or a traveler in a new city, to find high-rated places to eat and drink in your area to share with other like minded individuals!",
    "features": [
      "Profile Creation: Register and set-up your profile with up to 3 pictures, defining what style of food you like, your budget, and what you are looking for with others!",
      "Create Experiences: Based on your profile's settings and your location, you can create an experience for others to join you in your quest to find the best places to eat and drink!",
      "Matching algorithm: Just connect to the app and see if you match with other users! If you do, you can chat with them and plan your next experience!",
      "Google Places API integration: Our app is integrated with Google Places API to provide you with the best places to eat and drink in your area!",
      "User-Friendly: Our app is mobile friendly, so you can use it on the go!",
      "Chat and notifications system: Experience creators get to choose interested participants. Once selected, a chat is created between the creator and the participants to plan the experience!",
      "Deployment: Deployed to use in the shared link to use for all",
      "Frontend: React, TailwindCSS, Javascript.",
      "Backend: Ruby on Rails, Action Cable WebSocket, Google Places API, PostgreSQL with session based authentication"
    ],
    "prodLink": "https://comeeat.io/",
    "githubLink": "https://github.com/nexxai/ComeEat",
    "images": [
      {
        "original": "img/portfolio/comeeat/intro.gif",
        "description": "Welcome"
      },
      {
        "original": "img/portfolio/comeeat/profile.png",
        "description": "Profile page"
      },
      {
        "original": "img/portfolio/comeeat/profile-settings.png",
        "description": "Profile settings page"
      },
      {
        "original": "img/portfolio/comeeat/create-experience.gif",
        "description": "Create experience"
      },
      {
        "original": "img/portfolio/comeeat/found-experience.gif",
        "description": "Found experience"
      },
      {
        "original": "img/portfolio/comeeat/chat.png",
        "description": "Chat page"
      }
    ]
  }
}